# Машинное обучение и анализ данных

## Высшая Школа Цифровой Культуры

## Библиотека $\mathsf{pandas}$

Подключение основных возможностей библиотеки $\mathsf{pandas}$ осуществляется двумя строчками кода:

In [1]:
import pandas as pd
from pandas import Series, DataFrame

In [ ]:
numbers = Series([1, -3, 2, 7]) #Преобразование списка в серию
print(numbers) #Вывод серии

:

In [4]:
numbers = Series([1, -3, 2, 7]) #Преобразование списка в серию
print(numbers.index) #Вывод индексов в формате индексов pandas
print(numbers.values) #Вывод значений серии

RangeIndex(start=0, stop=4, step=1)
[ 1 -3  2  7]

In [5]:
numbers = Series([1, -3, 2, 7], index=['d', 'b', 'a', 'c']) #Создание серии на основе списка значений и списка индексов
print(numbers) #Вывод серии

d    1
b   -3
a    2
c    7
dtype: int64

In [12]:
numbers = Series([1, -3, 2, 7], index=['a', 'b', 'a', 'c']) #Серия, имеющая пару одинаковых индексов

In [15]:
numbers['a'].values #Вывод значений серии, отвечающих индексу 'a'

array([1, 2])

In [16]:
numbers[['a', 'c']].values #Вывод значений серии, отвечающих индексам 'a' и 'c'

array([1, 2, 7])

In [17]:
numbers > 0

a     True
b    False
a     True
c     True
dtype: bool

In [18]:
numbers[numbers > 0]

a    1
a    2
c    7
dtype: int64

In [19]:
numbers + 2

a    3
b   -1
a    4
c    9
dtype: int64

In [20]:
person = {'name': 'Степан', 'gender': 'муж.', 'age': 20} #Создание словаря
person_series = Series(person) #Преобразование словаря в серию

In [21]:
person_series #Вывод серии данных

name      Степан
gender      муж.
age           20
dtype: object

In [22]:
cars = {'name': ['ford torino', 'peugeot 504', 'fiat 124b'], 'hp': [140, 87, 76]} #Создание словаря из списков
cars_frame = DataFrame(cars) #Создание фрейма данных на основе словаря cars

In [23]:
cars_frame #Вывод фрейма данных

          name   hp
0  ford torino  140
1  peugeot 504   87
2    fiat 124b   76

In [24]:
cars_frame['name']

0    ford torino
1    peugeot 504
2      fiat 124b
Name: name, dtype: object

In [25]:
cars_frame.name

0    ford torino
1    peugeot 504
2      fiat 124b
Name: name, dtype: object

In [26]:
cars = {'name': ['ford torino', 'peugeot 504', 'fiat 124b'],
        'hp': [140, 87, 76],
        'weight': [3449, 2672, 2065]}
cars_frame = DataFrame(cars, columns=['name', 'weight', 'hp'],
                             index=['one', 'two', 'three'])

In [27]:
cars_frame

              name  weight   hp
one    ford torino    3449  140
two    peugeot 504    2672   87
three    fiat 124b    2065   76

In [28]:
cars_frame = DataFrame(cars, columns=['weight', 'hp'],
                             index=cars['name'])

In [29]:
cars_frame

             weight   hp
ford torino    3449  140
peugeot 504    2672   87
fiat 124b      2065   76

In [30]:
cars_frame.loc['ford torino']

weight    3449
hp         140
Name: ford torino, dtype: int64

In [31]:
cars_frame.loc['ford torino'].to_frame()

        ford torino
weight         3449
hp              140

In [32]:
cars_frame.loc['ford torino'].to_frame().T

             weight   hp
ford torino    3449  140

In [33]:
cars_frame.loc['peugeot 504']['hp']

87

In [34]:
cars_frame.loc['peugeot 504']['hp'] = 140

In [35]:
cars_frame

             weight   hp
ford torino    3449  140
peugeot 504    2672  140
fiat 124b      2065   76

In [36]:
new_cars_frame = cars_frame.drop(['fiat 124b'])

In [37]:
new_cars_frame

             weight   hp
ford torino    3449  140
peugeot 504    2672  140

In [38]:
new_cars_frame = cars_frame.drop(['hp'], axis=1)

In [39]:
new_cars_frame

             weight
ford torino    3449
peugeot 504    2672
fiat 124b      2065

In [42]:
numbers = Series([1, -3, 2, 7])
sorted_numbers = numbers.sort_values()
print(numbers)
print(sorted_numbers)

0    1
1   -3
2    2
3    7
dtype: int64
1   -3
0    1
2    2
3    7
dtype: int64

In [43]:
numbers = Series([1, -3, 2, 7])
sorted_numbers = numbers.sort_values(ascending=False)
print(numbers)
print(sorted_numbers)

0    1
1   -3
2    2
3    7
dtype: int64
3    7
2    2
0    1
1   -3
dtype: int64

In [44]:
cars = {'name': ['ford torino', 'peugeot 504', 'fiat 124b'],
        'hp': [140, 76, 76],
        'weight': [3449, 2672, 2065]}
cars_frame = DataFrame(cars, columns=['weight', 'hp'],
                             index=cars['name'])
cars_frame.sort_values('hp')

             weight   hp
peugeot 504    2672   76
fiat 124b      2065   76
ford torino    3449  140

In [45]:
cars_frame.sort_values(['hp', 'weight'], ascending=[True, False])

             weight   hp
peugeot 504    2672   76
fiat 124b      2065   76
ford torino    3449  140

In [46]:
cars = {'name': ['ford torino', 'peugeot 504', 'fiat 124b'],
        'hp': [140, 87, 76],
        'weight': [3449, 2672, 2065]}
cars_frame = DataFrame(cars, columns=['weight','hp'],
                             index=cars['name'])

In [47]:
cars_frame.min()

weight    2065
hp          76
dtype: int64

In [48]:
cars_frame_norm = (cars_frame - cars_frame.min()) / (cars_frame.max() - cars_frame.min())

In [49]:
cars_frame_norm

               weight        hp
ford torino  1.000000  1.000000
peugeot 504  0.438584  0.171875
fiat 124b    0.000000  0.000000

In [50]:
cars_frame.describe()

            weight          hp
count     3.000000    3.000000
mean   2728.666667  101.000000
std     693.737943   34.219877
min    2065.000000   76.000000
25%    2368.500000   81.500000
50%    2672.000000   87.000000
75%    3060.500000  113.500000
max    3449.000000  140.000000

In [51]:
cars_frame_norm.describe()

         weight        hp
count  3.000000  3.000000
mean   0.479528  0.390625
std    0.501256  0.534686
min    0.000000  0.000000
25%    0.219292  0.085938
50%    0.438584  0.171875
75%    0.719292  0.585938
max    1.000000  1.000000

### Импорт данных

In [34]:
all_cars = pd.read_csv('auto-mpg-quiz.csv', index_col = 'name')
 # Файл auto-mpg.csv находится в той же директории, что и файл Jupyter блокнота
all_cars.head()

                            mpg  cyl  displ   hp  weight  accel  yr  origin
name
chevrolet chevelle malibu  18.0    8  307.0  130    3504   12.0  70       1
buick skylark 320          15.0    8  350.0  165    3693   11.5  70       1
plymouth satellite         18.0    8  318.0  150    3436   11.0  70       1
amc rebel sst              16.0    8  304.0  150    3433   12.0  70       1
ford torino                17.0    8  302.0  140    3449   10.5  70       1

In [35]:
new_cars = all_cars.drop(['yr', 'origin', 'displ', 'mpg'], axis=1)
new_cars.head()

                           cyl   hp  weight  accel
name
chevrolet chevelle malibu    8  130    3504   12.0
buick skylark 320            8  165    3693   11.5
plymouth satellite           8  150    3436   11.0
amc rebel sst                8  150    3433   12.0
ford torino                  8  140    3449   10.5

In [36]:
all_cars = pd.read_csv('auto-mpg-quiz.csv', 
                       delimiter=',', 
                       index_col='name',
                       decimal='.', 
                       usecols=['name', 'hp', 'cyl', 'weight', 'accel'])
all_cars.head()

                           cyl   hp  weight  accel
name
chevrolet chevelle malibu    8  130    3504   12.0
buick skylark 320            8  165    3693   11.5
plymouth satellite           8  150    3436   11.0
amc rebel sst                8  150    3433   12.0
ford torino                  8  140    3449   10.5

In [37]:
all_cars.describe()

              cyl          hp       weight       accel
count  392.000000  392.000000   392.000000  392.000000
mean     5.471939  104.469388  2977.584184   15.541327
std      1.705783   38.491160   849.402560    2.758864
min      3.000000   46.000000  1613.000000    8.000000
25%      4.000000   75.000000  2225.250000   13.775000
50%      4.000000   93.500000  2803.500000   15.500000
75%      8.000000  126.000000  3614.750000   17.025000
max      8.000000  230.000000  5140.000000   24.800000

In [38]:
all_cars = pd.read_csv('auto-mpg.csv', 
                       delimiter=',', 
                       index_col='car name', 
                       nrows=5, 
                       decimal='.', 
                       usecols=['car name', 'horsepower', 'cylinders', 'weight'])

FileNotFoundError: [Errno 2] No such file or directory: 'auto-mpg.csv'

In [ ]:
all_cars.head()

    mpg  cyl  displ   hp  weight  accel  yr  origin                       name
0  18.0    8  307.0  130    3504   12.0  70       1  chevrolet chevelle malibu
1  15.0    8  350.0  165    3693   11.5  70       1          buick skylark 320
2  18.0    8  318.0  150    3436   11.0  70       1         plymouth satellite
3  16.0    8  304.0  150    3433   12.0  70       1              amc rebel sst
4  17.0    8  302.0  140    3449   10.5  70       1                ford torino

In [2]:
"""
Опрос 7
При помощи библиотеки pandas импортируйте набор данных об автомобилях в формате CSV. Колонка 'name' должна быть использована в качестве индекса. Десятичный разделитель — точка, разделитель колонок — запятая. Предполагается, что pandas уже импортирован следующим образом: import pandas as pd

"""

import pandas as pd
from pandas import Series, DataFrame
pd.read_csv('auto-mpg-quiz.csv', delimiter=',', decimal='.', index_col = 'name')
pd.read_csv('auto-mpg-quiz.csv', index_col = 'name')

                            mpg  cyl  displ   hp  weight  accel  yr  origin
name
chevrolet chevelle malibu  18.0    8  307.0  130    3504   12.0  70       1
buick skylark 320          15.0    8  350.0  165    3693   11.5  70       1
plymouth satellite         18.0    8  318.0  150    3436   11.0  70       1
amc rebel sst              16.0    8  304.0  150    3433   12.0  70       1
ford torino                17.0    8  302.0  140    3449   10.5  70       1
...                         ...  ...    ...  ...     ...    ...  ..     ...
ford mustang gl            27.0    4  140.0   86    2790   15.6  82       1
vw pickup                  44.0    4   97.0   52    2130   24.6  82       2
dodge rampage              32.0    4  135.0   84    2295   11.6  82       1
ford ranger                28.0    4  120.0   79    2625   18.6  82       1
chevy s-10                 31.0    4  119.0   82    2720   19.4  82       1

[392 rows x 8 columns]

In [4]:
all_cars = pd.read_csv('auto-mpg-quiz.csv', 
                       delimiter=',', 
                       index_col='name',
                       decimal='.', 
                       usecols=['name', 'hp', 'cyl', 'weight', 'accel'])
all_cars.head()

                           cyl   hp  weight  accel
name
chevrolet chevelle malibu    8  130    3504   12.0
buick skylark 320            8  165    3693   11.5
plymouth satellite           8  150    3436   11.0
amc rebel sst                8  150    3433   12.0
ford torino                  8  140    3449   10.5

In [5]:
all_cars[all_cars.cyl == 4]

                              cyl  hp  weight  accel
name
toyota corona mark ii           4  95    2372   15.0
datsun pl510                    4  88    2130   14.5
volkswagen 1131 deluxe sedan    4  46    1835   20.5
peugeot 504                     4  87    2672   17.5
audi 100 ls                     4  90    2430   14.5
...                           ...  ..     ...    ...
ford mustang gl                 4  86    2790   15.6
vw pickup                       4  52    2130   24.6
dodge rampage                   4  84    2295   11.6
ford ranger                     4  79    2625   18.6
chevy s-10                      4  82    2720   19.4

[199 rows x 4 columns]

In [13]:
all_cars[(all_cars.cyl == 4) & (all_cars.hp > 80)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [16]:
a = all_cars[(all_cars.cyl == 4) & (all_cars.hp > 80) | (all_cars.cyl == 8) & (all_cars.hp > 90)]
a.weight.describe()

count     188.000000
mean     3400.303191
std       870.950430
min      2075.000000
25%      2584.250000
50%      3434.500000
75%      4194.750000
max      5140.000000
Name: weight, dtype: float64